# **CLI コマンド一覧**

## **CLI `show version`**

### **用途**

機器のファームウェアバージョンなどを確認する際に利用します。

### **出力例**

```
MLB20079-LB1-Active#show version
Thunder Series Unified Application Service Gateway TH1030S
Copyright 2007-2017 by A10 Networks, Inc. All A10 Networks products are
protected by one or more of the following US patents:
9756071, 9742879, 9722918, 9712493, 9705800, 9661026, 9621575, 9609052,
9602442, 9596286, 9596134, 9584318, 9544364, 9537886, 9531846, 9497201,
9477563, 9398011, 9386088, 9356910, 9350744, 9344456, 9344421, 9338225,
9294503, 9294467, 9270774, 9270705, 9258332, 9253152, 9231915, 9219751,
9215275, 9154584, 9154577, 9124550, 9122853, 9118620, 9118618, 9106561,
9094364, 9060003, 9032502, 8977749, 8943577, 8918857, 8914871, 8904512,
8897154, 8868765, 8849938, 8826372, 8813180, 8782751, 8782221, 8595819,
8595791, 8595383, 8584199, 8464333, 8423676, 8387128, 8332925, 8312507,
8291487, 8266235, 8151322, 8079077, 7979585, 7804956, 7716378, 7665138,
7675854, 7647635, 7627672, 7596695, 7577833, 7552126, 7392241, 7236491,
7139267, 6748084, 6658114, 6535516, 6363075, 6324286, RE44701, 8392563,
8103770, 7831712, 7606912, 7346695, 7287084, 6970933, 6473802, 6374300
64-bit Advanced Core OS (ACOS) version 4.1.1-P6, build 62 (Nov-10-2017,20:07)
Booted from Hard Disk primary image
Serial Number: TH10B63318151010
aFleX version: 2.0.0
aXAPI version: 3.0
Hard Disk primary image (default) version 4.1.1-P6, build 62
Hard Disk secondary image version 4.1.1-P6, build 62
Last configuration saved at Nov-28-2018, 17:29
Hardware: 8 CPUs(Stepping 9), Single 74G Hard disk
Memory 8116 Mbyte, Free Memory 1376 Mbyte
Hardware Manufacturing Code: 181511
Current time is Feb-14-2019, 16:29
The system has been up 139 days, 2 hours, 28 minutes
```

### **主要項目の解説**

* **64-bit Advanced Core OS (ACOS) version**: 利用ファームウェアバージョン  
* **Serial Number**: シリアル番号  
* **The system has been up**: 起動開始からの経過時間  
* **Last configuration saved at**: 最終設定保存期日  
* **Hard Disk primary image (default) version XXX**: プライマリディスクに保存されているイメージのバージョン  
* **Hard Disk secondary image version XXX**: セカンダリディスクに保存されているイメージのバージョン

### **判断基準**

コマンド表示に対し結果が出力されること

---

## **CLI `show ip route`**

### **用途**

経路情報の確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active>show ip route
Codes: K - kernel, C - connected, S - static, R - RIP, B - BGP
O - OSPF, IA - OSPF inter area
N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
E1 - OSPF external type 1, E2 - OSPF external type 2
i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
* - candidate default
Gateway of last resort is 158.205.214.129 to network 0.0.0.0
S* 0.0.0.0/0 [1/0] via 158.205.214.129, ve 10
S 10.10.10.0/24 [1/0] via 10.41.2.120, ve 20
C 10.41.2.64/26 is directly connected, ve 20
C 10.41.3.64/26 is directly connected, ve 30
C 10.41.5.0/24 is directly connected, ve 30
S 10.41.50.0/24 [1/0] via 10.41.5.12, ve 30
S 10.100.10.0/24 [1/0] via 10.41.2.96, ve 20
C 158.205.143.100/30 is directly connected, ve 50
C 158.205.214.128/28 is directly connected, ve 10
S 192.168.10.0/24 [1/0] via 10.41.5.12, ve 30
S 192.168.200.0/26 [1/0] via 10.41.2.120, ve 20
S 192.168.201.0/29 [1/0] via 10.41.2.96, ve 20
```

---

## **CLI `show ipv6 route`**

### **用途**

IPv6の経路情報の確認時に利用します。

### **出力例**

```
ta1-mng-LB01-Standby#show ipv6 route
IPv6 Routing Table
Codes: K - kernel route, C - connected, S - static, R - RIP, O - OSPF,
i - IS-IS, B - BGP
Timers: Uptime
S ::/0 [1/0] via 2001:310:3010:200:202:218:215:103, ve 20, 03w5d02h
C 2001:310:3010:200::/64 via ::, ve 20, 03w5d02h
C 2001:310:3010:201::/64 via ::, ve 30, 02:50:19
```

---

## **CLI `show ip route <xxx.xxx.xxx.xxx>`**

### **用途**

特定IPアドレスに対する経路情報の確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active>show ip route 192.168.10.1
Routing entry for 192.168.10.0/24
Known via "static", distance 1, metric 0, best
* 10.41.5.12, via ve 30
```

### **主要項目の解説**

* **Routing entry for 192.168.10.0/24**: 対象IPに関する経路情報  
* **Known via "static", distance 1, metric 0, best / \* 10.41.5.12, via ve 30**:  
  * 対象IPアドレスに対する経路情報は「192.168.10.0/24」  
  * 経路設定は「static」  
  * Next-hopは「10.41.5.12」  
  * 経由I/Fは「ve 30」

### **判断基準**

あて先となるIPアドレスの送信先 I/F や Next-hop アドレスに認識差異が無いこと。 Next-hop が static-route なのか、default gateway なのか等明確にしておくこと。

---

## **CLI `show vrrp-a`**

### **用途**

冗長状態の確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active>show vrrp-a
vrid 1Unit State Weight Priority
1 (Local) Active 65534 100
became Active at: Oct 19 17:46:45 2018
for 117 Day,22 Hour,34 min
2 (Peer) Standby 65534 90 *
vrid that is running: 1
```

---

## **CLI `show vrrp-a setid-monitor`**

### **用途**

冗長状態の詳細確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active>show vrrp-a setid-monitor
set id 1interface ve30, device 2, IP: 10.41.3.125, MAC: 001f.a015.1e61 VLAN: 30, last observed 0 seconds ago
interface ve20, device 2, IP: 10.41.2.125, MAC: 001f.a015.1e62 VLAN: 20, last observed 0 seconds ago
interface ve10, device 2, IP: 158.205.214.141, MAC: 001f.a015.1e63 VLAN: 10, last observed 0 seconds ago
interface ve50, device 2, IP: 158.205.143.102, MAC: 001f.a015.1e5f VLAN: 50, last observed 0 seconds ago
```

### **主要項目の解説**

* **Unit**: 機器番号  
* **State**: 機器稼働状態  
* **Weight**: 機器重み付け  
* **Priority**: 機器優先度  
* **vrid that is running**: 運用中VRID

### **判断基準**

冗長を構成している主従2台とも表示されていること。 主従どちらかが必ずActiveであること。

---

## **CLI `show interfaces brief`**

### **用途**

I/Fの概略状態を確認する際に利用します。

### **出力例**

```
MLB20079-LB1-Active#show interfaces brief
Port Link Dupl Speed Trunk Vlan MAC IP Address IPs Name
------------------------------------------------------------------------------------
mgmt Down auto auto N/A N/A 001f.a015.1d80 172.31.31.31/24 1
1 Up Full 1000 None 10 001f.a015.1d7f 0.0.0.0/0 0
2 Up Full 100 None 20 001f.a015.1d7e 0.0.0.0/0 0
3 Up Full 1000 None 30 001f.a015.1d7d 0.0.0.0/0 0
4 Disb None None None 1 001f.a015.1d7c 0.0.0.0/0 0
5 Up Full 1000 1 Tag 001f.a015.1d7b 0.0.0.0/0 0
6 Up Full 1000 1 Tag 001f.a015.1d7a 0.0.0.0/0 0
7 Disb None None None 1 001f.a015.1d79 0.0.0.0/0 0
8 Disb None None None 1 001f.a015.1d78 0.0.0.0/0 0
9 Disb None None None 1 001f.a015.1d77 0.0.0.0/0 0
10 Disb None None None 1 001f.a015.1d76 0.0.0.0/0 0
ve10 Up N/A N/A N/A 10 001f.a015.1d7f 158.205.214.140/28 1
ve20 Up N/A N/A N/A 20 001f.a015.1d7f 10.41.2.124/26 1
ve30 Up N/A N/A N/A 30 001f.a015.1d7f 10.41.3.124/26 2
ve50 Up N/A N/A N/A 50 001f.a015.1d7f 158.205.143.101/30 1
```

### **主要項目の解説**

* **Port**: I/F名称  
* **Link**: コマンド投入時点でのI/Fのリンク状況  
* **Dupl**: I/Fのデュプレックス設定状況  
* **Speed**: I/Fの帯域設定状況  
* **Trunk**: tag VLANの利用可否 (通常は未利用)  
* **Vlan**: I/Fに紐付けているVLAN ID情報  
* **MAC**: 各I/FのMACアドレス  
* **IP Address**: 各I/Fに設定されているIPアドレス

### **判断基準**

意図したI/FにおけるIPアドレス等の情報が表示されること。

---

## **CLI `show ipv6 interfaces`**

### **用途**

各I/Fに設定されているIPv6アドレスの詳細を確認する際に利用します。

### **出力例**

```
ta1-mng-LB01-Standby#show ipv6 interfaces
Port IPv6 Address Scope Type
----------------------------------------------------------------------------------------
ve20 2001:310:3010:200:202:218:215:101/64 global unicast
fe80::21f:a0ff:fe23:c183/64 link-local unicast
ve30 2001:310:3010:201:202:218:250:165/64 global unicast
fe80::21f:a0ff:fe23:c184/64 link-local unicast
```

### **主要項目の解説**

* **Port**: I/F名称  
* **IPv6 Address**: 該当インターフェースに設定されているIPv6アドレス  
* **Scope**: アドレスのスコープ（利用範囲）  
* **Type**: アドレスの種類

### **判断基準**

意図したI/FにおけるIPアドレス等の情報が表示されること。

---

## **CLI `show counters interface <I/F名>`**

### **用途**

I/Fでエラー等が発生していないことを確認する際に利用します。

### **出力例**

```
MLB20079-LB1-Active>show counters interface ethernet 1
Input packets 20152331929
Input bytes 9186301591029
Received broadcasts 307456
Received multicasts 243958105
Received unicasts 19908066368
Input errors 2
CRC 0
Frames 0
Runts 0
Giants 0
Output packets 25367108958
Output bytes 20492649009935
Transmitted braodcasts 2763724
Transmitted multicasts 59909342
Transmitted unicasts 25304435892
Output errors 0
Collisions 0
```

### **主要項目の解説**

全て積算値です。

* **Input packets**: 流入パケット量  
* **Input bytes**: 流入通信量(bytes)  
* **Input errors**: 流入側エラーパケット量  
* **Output packets**: 流出パケット量  
* **Output bytes**: 流出通信量(bytes)  
* **Output errors**: 流出側エラーパケット量  
* **CRC**: CRCエラー量  
* **Collisions**: 衝突発生数

### **判断基準**

各項エラーやCRC/Collision カウンタが上昇していないこと。

---

## **CLI `show interfaces media`**

### **用途**

I/Fで利用しているメディアの詳細を表示します。

### **出力例**

```
TH1030S#show interfaces media
port 1:Show interface media feature is not supported on this port
port 2:Show interface media feature is not supported on this port
port 3:Show interface media feature is not supported on this port
port 4:Show interface media feature is not supported on this port
port 5:Show interface media feature is not supported on this port
port 6:Show interface media feature is not supported on this port
port 7:Show interface media feature is not supported on this port
port 8:Show interface media feature is not supported on this port
port 9:Type : No SFP device detected
port 10:Type : No SFP device detected
```

### **主要項目の解説**

* **Port ～**: ポート番号  
* **Show interface media feature is not supported on this port**: 10/100/1000BASE-T等のトランシーバ不利用ポート  
* **Type : No SFP device detected**: SFPが未挿入

### **判断基準**

基本的にはSFP未利用。

---

## **CLI `show interfaces statistics`**

### **用途**

各I/Fのトラフィック状態を表示します。

### **出力例**

```
MLB20067-LB1-Active#show interfaces statistics
Port InPPS InBPS OutPPS OutBPS Time
--------------------------------------------------------------------------
1 7.98 5082.07 8.38 5128.38 11:37:19
2 13.97 5493.26 19.96 5941.19 11:37:19
3 0.00 0.00 0.00 0.00 11:37:19
4 0.00 0.00 0.00 0.00 11:37:19
5 2.40 2342.62 2.79 2384.54 11:37:19
6 2.40 2342.62 2.40 2342.62 11:37:19
7 0.00 0.00 0.00 0.00 11:37:19
8 0.00 0.00 0.00 0.00 11:37:19
--------------------------------------------------------------------------
Tot 26.75 15260.57 33.53 15796.73
--------------------------------------------------------------------------
```

---

## **CLI `show interfaces statistics <I/F名>`**

### **用途**

指定したI/Fのトラフィック状態を表示します。

### **出力例**

```
MLB20067-LB1-Active#show interfaces statistics ethernet 1
Port InPPS InBPS OutPPS OutBPS Time
--------------------------------------------------------------------------
1 6.80 4979.00 8.40 6904.39 11:41:20
--------------------------------------------------------------------------
Tot 6.80 4979.00 8.40 6904.39
--------------------------------------------------------------------------
```

---

## **CLI `show session`**

### **用途**

セッション状況確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active>show session
Traffic Type Total
--------------------------------------------
TCP Established 5
TCP Half Open 170
SCTP Established 0
SCTP Half Open 0
UDP 0
Non TCP/UDP IP sessions 0
Other 0
Reverse NAT TCP 0
Reverse NAT UDP 0
Curr Free Conn 16494335
Conn Count 329549083
Conn Freed 329548908
TCP SYN Half Open 0
Conn SMP Alloc 75
Conn SMP Free 9
Conn SMP Aged 0
Conn Type 0 Available 32440320
Conn Type 1 Available 16383820
Conn Type 2 Available 8191995
Conn Type 3 Available 4055040
Conn Type 4 Available 2047995
Conn SMP Type 0 Available 32440320
Conn SMP Type 1 Available 16220160
Conn SMP Type 2 Available 8110080
Conn SMP Type 3 Available 4063165
Conn SMP Type 4 Available 2027520
```

### **主要項目の解説**

* **TCP Established**: 確立したTCPコネクション数  
* **TCP Half Open**: 確立前のTCPコネクション数  
* **UDP**: UDPコネクション数  
* **Non TCP/UDP IP sessions**: TCP/UDP以外のIPセッション数  
* **Other**: その他コネクション数  
* **Curr Free Conn**: コマンド投入時点の保持コネクション数  
* **TCP SYN Half Open**: 3wayハンドシェイク確立前のコネクション数

### **判断基準**

「Curr Free Conn」の数値が0に近似していないこと。 TCP等のHalf Open数が極端に多くなっていないこと(目安：100以上)。

---

## **CLI `show system platform statistics`**

### **用途**

筐体内におけるパケット処理の正常性確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active#show system platform statistics
ALB Packet statistics:
# Packets received: 113590555620
# Packets sent free: 9364533945
# Packets sent no free: 12449074
# Packets drop: 87353
# Packets link down drop: 0
# Error packets drop: 0
# Packets to Linux: 329360080
# Packets from Linux: 365223424
# Packets from Linux dropped: 301
ALB<->LNX Statistics:
TYPE: Q0 Q1 Q2 Q3 Q4 Q5 Q6 Q7
atol 16994167 91656868 47386219 47326713 78826377 47606411 0 0
ltoa 365223425 0 0 0 0 0 0 0
ltoafail 0
alloc 69679872, free 34252416, send 365223425, recv 329796755, buff in cache 786, alloc failed 0
pkts to ip: 329796755 jumbo: 0
pkts to alb: 365223425 jumbo: 0
alloc_q: next_to_clean 0, flag 1
free_q: next_to_use 0, flag 0
# Buffers allocated cache: 862025530
# Buffers allocated real: 266641408
# Buffers freed cache: 1048128224
# Buffers freed real: 452749312
# Apps buff alloc from sys: 0
(以下略)
```

### **主要項目の解説**

全て積算値です。

* **Packets received**: パケット受信量  
* **Packets drop**: パケット破棄量  
* **Packets link down drop**: リンクダウンに伴うパケット破棄量  
* **Error packets drop**: エラーによるパケット破棄量

### **判断基準**

Errorやdropのカウンタ値が上昇していないこと。

---

## **CLI `show system resource-usage`**

### **用途**

自機のSLB関連設定を確認する際に利用します。

### **出力例**

```
MLB20079-LB1-Active#show system resource-usage
Resource Current Default Minimum Maximum
--------------------------------------------------------------------------
l4-session-count 16777216 16777216 4194304 33554432
nat-pool-addr-count 500 500 500 2000
class-list-ipv6-addr-count 1024000 1024000 1024000 2048000
class-list-ac-entry-count 256000 256000 256000 512000
auth-portal-html-file-size 20 20 4 120
auth-portal-image-file-size 6 6 1 80
max-aflex-file-size 32768 32768 16384 262144
aflex-table-entry-count 102400 102400 102400 6291456
```

### **主要項目の解説**

* **l4-session-count**: L4セッション数設定上限  
* **nat-pool-addr-count**: NATアドレス登録総数  
* **class-list-ipv6-addr-count**: クラスリストの合計IPv6アドレス数  
* **class-list-ac-entry-count**: ACクラスリストの合計エントリ数  
* **auth-portal-html-file-size**: 認証ポータルの最大htmlファイルサイズ  
* **auth-portal-image-file-size**: デフォルトポータルの最大イメージファイルサイズ  
* **max-aflex-file-size**: aFleX最大ファイルサイズ  
* **aflex-table-entry-count**: aFleXテーブルエントリの合計  
* **max-aflex-authz-collection-number**: aFleX認証でサポートされる最大数

### **判断基準**

コマンド入力に対し表示がされること。

---

## **CLI `show slb performance`**

### **用途**

処理状況の確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active#show slb performance
Refreshing SLB performance every 1 seconds. (press ^C to quit)
Note: cpi conn/interval, tpi transactions/interval
CPU Usage L4cpi cpi tpi SSLcpi ServSSLcpi Natcpi FWcpi Time
-----------------------------------------------------------------------------------------------
0/0/0/0/0/... 69 0 0 0 0 0 0 16:45:28
```

---

## **CLI `show slb performance l4cpi`**

### **用途**

L4分散時の利用状況を確認する際に利用します。

### **出力例**

```
MLB20079-LB1-Active#show slb performance l4cpi
Refreshing SLB performance every 1 seconds. (press ^C to quit)
Note: cpi conn/interval, tpi transactions/interval
CPU Usage L4cpi Time
-----------------------------------------------------------------------------------------------
0/0/0/0/0/... 34 16:45:44
```

---

## **CLI `show slb performance sslcpi`**

### **用途**

SSL利用時の状況確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active#show slb performance sslcpi
Refreshing SLB performance every 1 seconds. (press ^C to quit)
Note: cpi conn/interval, tpi transactions/interval
CPU Usage SSLcpi ServSSLcpi Time
-----------------------------------------------------------------------------------------------
0/0/0/0/0/... 0 0 16:45:58
```

### **主要項目の解説**

* **fwcpi**: FW conn/interval  
* **interval**: Refresh Period  
* **l4cpi**: Layer 4 conn/interval  
* **l7cpi**: Layer 7 conn/interval  
* **l7tpi**: Layer 7 transactions/interval  
* **natcpi**: NAT conn/interval  
* **partition**: Display partition-stats  
* **sslcpi**: SSL conn/interval

### **判断基準**

コマンド入力に対し表示がされること。 CPU Usageが60%以上になっていないこと。

---

## **CLI `show slb ssl error`**

### **用途**

SSLのエラー発生状況確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active#show slb ssl error
app data in handshake 0
attempt to reuse sess in diff context 0
bad alert record 0
bad authentication type 0
bad change cipher spec 0
bad checksum 0
bad data returned by callback 0
bad decompression 0
bad dh g length 0
bad dh pub key length 0
bad dh p length 0
bad digest length 0
bad dsa signature 0
bad hello request 0
bad length 0
bad mac decode 0
bad message type 0
bad packet length 0
bad protocol version number 0
bad response argument 0
bad rsa decrypt 0
bad rsa encrypt 0
bad rsa e length 0
bad rsa modulus length 0
bad rsa signature 0
bad signature 0
bad ssl filetype 0
bad ssl session id length 0
bad state 0
(以下略)
```

### **主要項目の解説**

メーカー提供のコマンドリファレンスを参照願います。

### **判断基準**

コマンド入力に対し表示がされること。 どれかカウンタ上昇している項目が無いこと。

---

## **CLI `show slb ssl stats`**

### **用途**

SSLにおける稼働状況の確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active>show slb ssl stats
SSL module: Hardware
Number of SSL modules: 1
SSL module 1
number of enabled crypto engines: 16
number of available crypto engines: 16
number of requests handled: 0
Current clientside SSL connections: 0
Total clientside SSL connections: 0
Current serverside SSL connections: 0
Total serverside SSL connections: 0
Total Non SSL Bypass connections: 0
Total times of reusing SSL sessions(IDs) in client ssl 0
Total times of reusing SSL sessions(IDs) in server ssl 0
Failed SSL handshakes: 0
Failed crypto operations: 0
SSL memory usage: 8132 bytes
SSL server certificate errors: 0
SSL client certificate authorization failed: 0
SSL fail CA verification 0
HW Context Memory Total Count 497102
HW Context Memory in Use 0
HW Context Memory alloc failed 0
HW ring full 0
Record too big 0
Total client ssl context malloc failures: 0
Maximum SSL contexts 8256
Current SSL contexts in use 0
(以下略)
```

### **主要項目の解説**

* **Total clientside SSL connections**: 累積のSSLコネクション数  
* **Current clientside SSL connections**: コマンド投入時のSSLコネクション数  
* **Failed SSL handshakes**: SSLコネクション失敗数  
* **Failed crypto operations**: SSL暗号化失敗数

### **判断基準**

「Failed ～」で始まるカウンタの数値が上昇していないこと。 「Current SSL contexts in use」の値が「Maximum ～」の値に近づいていないこと。 「HW Context Memory in Use」の値が「Maximum ～」の値に近づいていないこと。

---

## **CLI `show slb virtual-server bind`**

### **用途**

バーチャルサーバの稼働状況確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active>show slb virtual-server bind
Total Number of Virtual Services configured: 18
---------------------------------------------------------------------------------
　　↓[バーチャルサーバ名] [VIP] [ステータス]
*Virtual Server : vip10.41.1.11 10.41.1.11 All Up
　　↓リアルサーバグループに対するヘルスチェック
+port 8009 http ====>app10_8009 State :All Up
↓リアルサーバ名 リアルサーバIP
+h10.41.3.115:8009 10.41.3.115 State : Up
+h10.41.3.116:8009 10.41.3.116 State : Up
=+port 8080 http ====>app10_8080 State :All Up
=+h10.41.3.115:8080 10.41.3.115 State : Up
=+h10.41.3.116:8080 10.41.3.116 State : Up
(以下略)
```

### **主要項目の解説**

* **Virtual Server**: バーチャルサーバ名、バーチャルサーバ用IPアドレス、バーチャルサーバのステータス  
* **port \[ポート番号\] \[プロトコル\] \====\> \[リアルサーバグループ名\] State : \[ステータス\]**: リアルサーバグループに対するヘルスチェック  
* **h\[リアルサーバIP\]:\[ポート番号\] \[リアルサーバIP\] State : \[ステータス\]**: リアルサーバ名、リアルサーバIP

### **判断基準**

設定済みバーチャルサーバ及びメンバーが全てUPしていること。

---

## **CLI `show slb resource-usage`**

### **用途**

バーチャルサーバの設定状況確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active#show slb resource-usage
Resource Current Default Minimum Maximum
--------------------------------------------------------------------------
nat-pool-addr-count 500 500 500 2000
real-server-count 1024 1024 512 8192
real-port-count 2048 2048 512 16384
service-group-count 512 512 512 8192
virtual-port-count 512 512 256 8192
virtual-server-count 512 512 512 4096
http-template-count 256 256 32 4096
proxy-template-count 256 256 32 4096
conn-reuse-template-count 256 256 32 4096
fast-tcp-template-count 256 256 32 4096
fast-udp-template-count 256 256 32 4096
client-ssl-template-count 256 256 32 8192
server-ssl-template-count 256 256 32 8192
stream-template-count 256 256 32 4096
persist-cookie-template-count 256 256 32 4096
persist-srcip-template-count 256 256 32 4096
health-monitor-count 1023 1023 512 1024
pbslb-subnet-count 65536 65536 65536 65536
gslb-site-count 500 500 500 500
gslb-device-count 1000 1000 1000 1000
gslb-service-ip-count 1024 1024 512 5000
gslb-service-port-count 2048 2048 512 10000
gslb-zone-count 5000 5000 5000 5000
gslb-service-count 10000 10000 10000 10000
gslb-policy-count 10000 10000 10000 10000
gslb-geo-location-count 5000000 5000000 5000000 5000000
(以下略)
```

### **主要項目の解説**

各項目について、デフォルト値・最小値・最大値が出力されます。

### **判断基準**

意図した設定(デフォルト値)になっていること。

---

## **CLI `show slb ssl-counters <virtual-server name>`**

### **用途**

SSLにおける稼働状況の確認時に利用します。

### **出力例**

```
MLB20028-LB1-Active#show slb ssl-counters
Global Stats
--------------------------------------------------------------------------------
Client ssl stats
Cumulative sessions = 28535235
ID Name Successes Failures
0x0300000a SSL3_RSA_DES_192_CBC3_SHA 30 0
0x03000005 SSL3_RSA_RC4_128_SHA 205 0
0x0300009e TLS1_DHE_RSA_AES_128_GCM_SHA256 25201 0
0x03000033 TLS1_DHE_RSA_AES_128_SHA 180 0
0x03000067 TLS1_DHE_RSA_AES_128_SHA256 88 0
0x0300009f TLS1_DHE_RSA_AES_256_GCM_SHA384 2564353 6403
0x03000039 TLS1_DHE_RSA_AES_256_SHA 435399 60
0x0300006b TLS1_DHE_RSA_AES_256_SHA256 5284 6
0x0300c02f TLS1_ECDHE_RSA_AES_128_GCM_SHA256 4516 0
0x0300c013 TLS1_ECDHE_RSA_AES_128_SHA 249 0
0x0300c027 TLS1_ECDHE_RSA_AES_128_SHA256 113 0
0x0300c030 TLS1_ECDHE_RSA_AES_256_GCM_SHA384 2296 3
0x0300c014 TLS1_ECDHE_RSA_AES_256_SHA 685 2
0x0300009c TLS1_RSA_AES_128_GCM_SHA256 24629 255
0x0300002f TLS1_RSA_AES_128_SHA 266 0
0x0300003c TLS1_RSA_AES_128_SHA256 114 0
0x0300009d TLS1_RSA_AES_256_GCM_SHA384 25132577 972
0x03000035 TLS1_RSA_AES_256_SHA 23567 0
0x0300003d TLS1_RSA_AES_256_SHA256 86267 0
Key Exchange Methods Successes Failures
RSA1024 bits 877 255
2048 bits 25266778 972
ECDHEprime256v1 7503 2
secp384r1 356 0
DHE1024 bits 3030505 6469
SSL/TLS Version Successes Failures
SSL3.0 0 7867
TLS1.0 375222 5025
(以下略)
```

### **主要項目の解説**

* **Cumulative sessions**: 起動してからの累積セッション数  
* **Key Exchange Methods**: 暗号化実施時の利用鍵  
* **SSL/TLS Version**: 暗号化コネクション構成時の利用手法  
* **Session Cache**: キャッシュしているセッション

### **判断基準**

「Cumulative sessions \=」直下のcipherリストが想定通りであること。 「SSL/TLS Version」直下のカウンタが想定通りにカウントアップしていること。

---

## **CLI `show health stat`**

### **用途**

筐体におけるセッション状況確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active#show health stat
Health monitor statistics
Total run time: : 3338 hours 45 minutes 34 seconds
Number of burst: : 0
max scan jiffie: : 24
min scan jiffie: : 1
average scan jiffie: : 4294967295
Opened socket: : 79250517
Open socket failed: : 0
Close socket: : 79250512
Connect failed: : 175486
Send packet: : 8921097
Send packet failed: : 8
Receive packet: : 4742377
Receive packet failed: : 1596285
Retry times: : 2629523
Timeout: : 3330455
Unexpected error: : 0
Conn Immediate Success: : 0
Socket closed before l7: : 0
Socket closed without fd notify: : 0
Configured health-check rate(/500ms) : Auto configured
Current health-check rate(/500ms) : 11
External health-check max rate(/200ms) : 2
Total number: : 50
Status UP: : 44
Status DOWN: : 6
Status UNKN: : 0
Status OTHER: : 0
(以下略)
```

### **主要項目の解説**

* **Total run time**: 経過時間  
* **Number of burst**: ハードウェア限界上限越え

### **判断基準**

以下項目が継続してカウントアップしていないこと:

* Number of burst  
* Open socket failed  
* Send packet failed

---

## **CLI `show health monitor`**

### **用途**

ヘルスモニタ状況確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active#show health monitor
Idle = Not used by any server In use = Used by server
Monitor Name Interval Retries Timeout Up-Retries Method Status
-------------------------------------------------------------------------
ping 5 3 5 1 ICMP In use
TCP3306 5 3 5 1 TCP In use
TCP7001 5 3 5 1 TCP In use
TCP7011 5 3 5 1 TCP In use
TCP22 5 3 5 1 TCP Idle
TCP8009 3 3 3 1 TCP In use
TCP8080 3 3 3 1 TCP In use
```

### **主要項目の解説**

* **Monitor Name**: モニター名  
* **Interval**: ヘルスチェック間隔  
* **Retries**: 再試行回数  
* **Timeout**: タイムアウト期限  
* **Up-Retries**: 再試行の際、UPとする試行回数  
* **Method**: ヘルスチェック方法

### **判断基準**

基本的にstatus が **In use** であること。

---

## **CLI `show system cpu-load-sharing statistics detail`**

### **用途**

筐体におけるCPU負荷状況の確認時に利用します。

### **出力例**

```
MLB20079-LB1-Active#show system cpu-load-sharing statistics detail
CPU Load-Sharing Stats 0 1 2 3 4 5 Total
---------------------
Load Sharing Triggered 0 0 0 0 0 0 0
Load Sharing Untriggered 0 0 0 0 0 0 0
Round Robin Pkt Received 0 0 0 0 0 0 0
Round Robin Pkt sent(fwd) 0 0 0 0 0 0 0
Round Robin Pkt sent(rev) 0 0 0 0 0 0 0
Round Robin drop for L7 0 0 0 0 0 0 0
Home CPU sent(new conn) 0 0 0 0 0 0 0
Home CPU sent(existed conn) 0 0 0 0 0 0 0
Home CPU sent(queue full drop) 0 0 0 0 0 0 0
```

---

## **CLI `show system platform cpu-packet-statistics`**

### **用途**

筐体における、CPU負荷に伴う転送状況の表示。

### **出力例**

```
MLB20079-LB1-Active#show system platform cpu-packet-statistics
CPU Rcvd Sent Dropped
------------------------------------------------------
0 60932445 384439707 46
1 11012300751 2449379824 16595
2 10983572853 2255640234 19210
3 13474028683 722871706 16493
4 10645151088 1681011635 17096
5 10631559830 1895898314 17913
```

### **主要項目の解説**

* **Load Sharing Triggered**: 負荷分散がトリガーされました  
* **Load Sharing Untriggered**: トリガーされていないロードシェアリング  
* **Round Robin Pkt Received**: ラウンドロビンパケットを受け取りました  
* **Round Robin Pkt sent(fwd)**: ラウンドロビンパケット送信（Forward）  
* **Round Robin Pkt sent(rev)**: ラウンドロビンパケット送信（Received）  
* **Round Robin drop for L7**: L7のラウンドロビンドロップ  
* **Home CPU sent(new conn)**: ホームCPUが送信されました（新しい接続）  
* **Home CPU sent(existed conn)**: 送信されたホームCPU（既存の接続）  
* **Home CPU sent(queue full drop)**: ホームCPUが送信されました（キューフルドロップ）

### **判断基準**

各項目でカウンタ値が上昇していないこと。

---

## **CLI `show log`**

### **用途**

筐体内のログ確認時に利用します。

### **出力例**

```
TH1030S#show log
Log Buffer: 30000
Feb 14 2019 12:52:04 Notice [SYSTEM]:A cli session for user "admin" from 127.0.0.1 has been opened. Session ID assigned is 4.
Feb 14 2019 12:52:04 Info [SYSTEM]:Local authentication successful (user: admin).
Feb 14 2019 12:35:14 Critical [SYSTEM]:Power Supply Right Unit Input Voltage is under threshold limit(120000). Current value 0, allowed range [90000, 264000]
Feb 14 2019 12:35:03 Notice [VCS]:Cannot start aVCS now
Feb 14 2019 12:35:03 Info [VCS]:Load aVCS config sequence info (.0)
Feb 14 2019 12:35:03 Info [AUTH]:A10 SAML service is starting successfully
Feb 14 2019 12:35:02 Info [INIT]:Data plane successfully initialized. ACOS is ready to process traffic.
Feb 14 2019 12:35:02 Notice [SYSTEM]:Session ID 1 is now closed.
Feb 14 2019 12:35:01 Notice [SYSTEM]:A cli session for user "admin" from 127.0.0.1 has been opened. Session ID assigned is 1.
Feb 14 2019 12:35:00 Info [L3]:LACP: LACP SYS-ID is set to interface:ethernet 8 h/w addr:00:1f:a0:15:2b:f6
Feb 14 2019 12:35:00 Info [COMPRESSION]:Hardware compression device not installed on the system
Feb 14 2019 12:34:55 Info [GSLB]:Initialization done
```

### **主要項目の解説**

メーカー提供のコマンドリファレンスを参照のこと。

### **判断基準**

コマンド投入に対しログが出力されること。

---

## **CLI `show bootimage`**

### **用途**

OSインストール状況の表示。

### **出力例**

```
MLB20066-LB2-Standby#show bootimage
(* = Default)
Version
-----------------------------------------------
Hard Disk primary 4.1.4-GR1-P1.78 (*)
Hard Disk secondary 4.1.4-GR1-P1.78
```

### **主要項目の解説**

* **default**: デフォルトbootimage  
* **Hard Disk primary**: プライマリパーティション  
* **Hard Disk secondary**: セカンダリパーティション

### **判断基準**

表示されること。

---

## **CLI `show hardware`**

### **用途**

ハードウェア情報の詳細確認時に利用します。

### **出力例**

```
TH1030S#show hardware
Thunder Series Unified Application Service Gateway TH1030S
Serial No : TH10B63318191033
CPU : Intel(R) Xeon(R) CPU
8 cores
9 stepping
Storage : Single 74G drive
Memory : Total System Memory 8116 Mbyte, Free Memory 2495 Mbyte
SSL Cards : 1 device(s) present
1 Nitrox III each with 16 cores
L2/3 ASIC : 0 device(s) present
IPMI : Present
Ports : 10
Flags : No CF
SMBIOS : Build Version: 4.6.5
Release Date: 08/25/2014
Bypass : Absent
```

### **主要項目の解説**

* **Serial No**: シリアル番号  
* **CPU**: CPU情報

### **判断基準**

表示されること。

---

## **CLI `show disk`**

### **用途**

HD容量やステータスを確認するときに使用します。

### **出力例**

```
MLB20079-LB1-Active>show disk
Total(MB) Used(MB) Free(MB) Usage
---------------------------------------------------
76319 41206 35112 53%
Device Primary Disk
------------------------------
md0 Active
md1 Active
```

### **主要項目の解説**

* **Total(MB)**: HD全体の容量  
* **Used(MB)**: 利用中の容量  
* **Free(MB)**: 空き容量  
* **Usage**: 利用率

### **判断基準**

Usageが90%まで上昇していないか。 ステータスがActiveとなっているか。

---

## **CLI `write memory <primary/secondary>`**

### **用途**

設定の保存。

### **出力例**

```
MLB20066-LB2-Standby#write memory primary
Building configuration...
Write configuration to default primary startup-config
[OK]MLB20066-LB2-Standby#
MLB20066-LB2-Standby#
MLB20066-LB2-Standby#write memory secondary
Building configuration...
Write configuration to default secondary startup-config
[OK]MLB20066-LB2-Standby#
```

### **主要項目の解説**

`all-patitions`オプションは、起動しているパーティションにしか保存しないので注意してください。

### **判断基準**

必ず両パーティションへ設定を保存すること。 設定を忘れ、もう一方のパーティションからブートした場合、最悪初期コンフィグで起動する可能性があります。

---

## **CLI `show techsupport`**

### **用途**

ベンダーサポートへのエスカレーション時に利用します。

### **出力例**

無し

### **注意点**

このコマンドは、負荷が高い(20%以上)状態では実施しないこと。

---

## **CLI `show environment`**

### **用途**

電源、ファン、温度のハードウェア情報を表示します。

### **出力例**

```
TH1060S#show environment
Updated information every 30 Seconds
Physical System temperature : 19C / 66F : OK-low/med
HW Fan Setting: Automatic
Physical CPU0 temperature : 40C / 104F
Physical System temperature2: 40C / 104F : OK-low/med
Fan1 : OK-low/med
Fan2 : OK-low/med
Fan3 : OK-low/med
System Voltage 12V : OK
System Voltage 5V : OK
System Voltage AVCC 3.3V : OK
System Voltage CPU0 VCore 1.8V : OK
System Voltage SB 5V : OK
System Voltage SB 3.3V : OK
Left Power Unit(Rear View) State: On
Right Power Unit(Rear View) State: On
```

### **主要項目の解説**

* **Left/Right Power Unit State**: 電源状態  
* **Physical temperature**: 温度  
* **Fan1/Fan2/Fan3**: FAN状態  
* **System Voltage**: システム内の電圧状態

### **判断基準**

* Left/Right Power Unit Stateが**On**であること。  
* Physical temperatureが**OK-low/med**表示で正常であること。  
* Fan1/Fan2/Fan3が**OK-low/med**表示で正常であること。  
* System Voltageが全て**OK**表示であること。

